###################################################################

# Created by write_sdc on Thu Dec 15 11:32:16 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports in_ready_o]
set_load -pin_load 3.40189 [get_ports {result_o[31]}]
set_load -pin_load 3.40189 [get_ports {result_o[30]}]
set_load -pin_load 3.40189 [get_ports {result_o[29]}]
set_load -pin_load 3.40189 [get_ports {result_o[28]}]
set_load -pin_load 3.40189 [get_ports {result_o[27]}]
set_load -pin_load 3.40189 [get_ports {result_o[26]}]
set_load -pin_load 3.40189 [get_ports {result_o[25]}]
set_load -pin_load 3.40189 [get_ports {result_o[24]}]
set_load -pin_load 3.40189 [get_ports {result_o[23]}]
set_load -pin_load 3.40189 [get_ports {result_o[22]}]
set_load -pin_load 3.40189 [get_ports {result_o[21]}]
set_load -pin_load 3.40189 [get_ports {result_o[20]}]
set_load -pin_load 3.40189 [get_ports {result_o[19]}]
set_load -pin_load 3.40189 [get_ports {result_o[18]}]
set_load -pin_load 3.40189 [get_ports {result_o[17]}]
set_load -pin_load 3.40189 [get_ports {result_o[16]}]
set_load -pin_load 3.40189 [get_ports {result_o[15]}]
set_load -pin_load 3.40189 [get_ports {result_o[14]}]
set_load -pin_load 3.40189 [get_ports {result_o[13]}]
set_load -pin_load 3.40189 [get_ports {result_o[12]}]
set_load -pin_load 3.40189 [get_ports {result_o[11]}]
set_load -pin_load 3.40189 [get_ports {result_o[10]}]
set_load -pin_load 3.40189 [get_ports {result_o[9]}]
set_load -pin_load 3.40189 [get_ports {result_o[8]}]
set_load -pin_load 3.40189 [get_ports {result_o[7]}]
set_load -pin_load 3.40189 [get_ports {result_o[6]}]
set_load -pin_load 3.40189 [get_ports {result_o[5]}]
set_load -pin_load 3.40189 [get_ports {result_o[4]}]
set_load -pin_load 3.40189 [get_ports {result_o[3]}]
set_load -pin_load 3.40189 [get_ports {result_o[2]}]
set_load -pin_load 3.40189 [get_ports {result_o[1]}]
set_load -pin_load 3.40189 [get_ports {result_o[0]}]
set_load -pin_load 3.40189 [get_ports status_o_NV_]
set_load -pin_load 3.40189 [get_ports status_o_DZ_]
set_load -pin_load 3.40189 [get_ports status_o_OF_]
set_load -pin_load 3.40189 [get_ports status_o_UF_]
set_load -pin_load 3.40189 [get_ports status_o_NX_]
set_load -pin_load 3.40189 [get_ports tag_o]
set_load -pin_load 3.40189 [get_ports out_valid_o]
set_load -pin_load 3.40189 [get_ports busy_o]
create_clock [get_ports clk_i]  -name MY_CLK  -period 12  -waveform {0 6}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst_ni]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[95]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[94]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[93]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[92]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[91]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[90]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[89]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[88]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[87]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[86]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[85]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[84]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[83]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[82]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[81]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[80]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[79]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[78]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[77]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[76]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[75]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[74]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[73]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[72]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[71]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[70]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[69]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[68]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[67]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[66]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[65]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[64]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[63]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[62]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[61]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[60]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[59]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[58]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[57]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[56]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[55]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[54]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[53]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[52]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[51]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[50]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[49]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[48]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[47]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[46]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[45]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[44]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[43]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[42]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[41]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[40]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[39]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[38]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[37]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[36]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[35]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[34]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[33]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[32]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {operands_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rnd_mode_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rnd_mode_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {rnd_mode_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {op_i[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {op_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {op_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {op_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports op_mod_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {src_fmt_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {src_fmt_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {src_fmt_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {dst_fmt_i[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {dst_fmt_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {dst_fmt_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {int_fmt_i[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {int_fmt_i[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports vectorial_op_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports tag_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports in_valid_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports flush_i]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports out_ready_i]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports in_ready_o]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {result_o[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports status_o_NV_]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports status_o_DZ_]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports status_o_OF_]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports status_o_UF_]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports status_o_NX_]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports tag_o]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports out_valid_o]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports busy_o]
